# Homework - My Game
"""
Создайте игру "Угадай число". В коде программы в переменную запишите любое число от 1 до 100
(в следующих уроках мы узнаем, как генерировать случаиное число), которое и должен угадать игрок.
Далее программа должна спросить у игрока угадать число. Если пользователь не угадал число
- программа сооощает, что загаданное число оольшеменьше и предлагает попробовать еще
раз, при этом программа ведет счета кол-ва попыток игрока.
Если игрок угадал число, тогда программа благодарит за игру и сообщает кол-во попыток, за которое было угадано число.
"""


# Homework - Answer